/*
    Compile unit: C:\rockband2\system\src\oggvorbis\smallft.c
    Producer: MW EABI PPC C-Compiler
    Language: C89
    Code range: 0x8054B660 -> 0x8054CA98
*/
static int ntryh[4]; // size: 0x10, address: 0x8090F450
static float tpi; // size: 0x4, address: 0x80A47538
// Range: 0x8054B660 -> 0x8054B88C
static void drfti1(int n /* r19 */, float * wa /* r20 */, int * ifac /* r21 */) {
    // Local variables
    float arg; // f31
    float argh; // f30
    float argld; // f29
    float fi; // f28
    int ntry; // r7
    int i; // r31
    int j; // r30
    int k1; // r29
    int l1; // r28
    int l2; // r27
    int ib; // r8
    int ld; // r26
    int ii; // r18
    int ip; // r3
    int is; // r25
    int nq; // r9
    int ido; // r24
    int ipm; // r23
    int nfm1; // r22
    int nl; // r10
    int nf; // r4

    // References
    // -> static float tpi;
    // -> static int ntryh[4];
}

// Range: 0x8054B88C -> 0x8054B8A4
static void fdrffti() {}

// Range: 0x8054B8A4 -> 0x8054BAA0
static void dradf2() {
    // Local variables
    int i; // r8
    int k; // r9
    float ti2; // f1
    float tr2; // f2
    int t0; // r10
    int t1; // r11
    int t2; // r12
    int t3; // r31
    int t4; // r30
    int t5; // r29
    int t6; // r28
}

static float hsqt2; // size: 0x4, address: 0x80A4753C
// Range: 0x8054BAA0 -> 0x8054BDF8
static void dradf4() {
    // Local variables
    int i; // r10
    int k; // r11
    int t0; // r12
    int t1; // r31
    int t2; // r30
    int t3; // r29
    int t4; // r28
    int t5; // r27
    int t6; // r26
    float ci2; // f5
    float ci3; // f6
    float ci4; // f0
    float cr2; // f7
    float cr3; // f8
    float cr4; // f2
    float ti1; // f3
    float ti2; // f1
    float ti3; // f2
    float ti4; // f4
    float tr1; // f9
    float tr2; // f5
    float tr3; // f6
    float tr4; // f7

    // References
    // -> static float hsqt2;
}

static float tpi; // size: 0x4, address: 0x80A47540
// Range: 0x8054BDF8 -> 0x8054C794
static void dradfg(int ido /* r22 */, int ip /* r23 */, int l1 /* r24 */, int idl1 /* r25 */, float * cc /* r26 */, float * c1 /* r27 */, float * c2 /* r28 */, float * ch /* r29 */, float * ch2 /* r30 */, float * wa /* r31 */) {
    // Local variables
    int idij; // r10
    int ipph; // r0
    int i; // r3
    int j; // r4
    int k; // r5
    int l; // r3
    int ic; // r28
    int ik; // r5
    int is; // r11
    int t0; // r6
    int t1; // r7
    int t2; // r8
    int t3; // r9
    int t4; // r10
    int t5; // r11
    int t6; // r12
    int t7; // r27
    int t8; // r31
    int t9; // r21
    int t10; // r20
    float dc2; // f0
    float ai1; // f3
    float ai2; // f4
    float ar1; // f5
    float ar2; // f6
    float ds2; // f0
    int nbd; // r19
    float dcp; // f31
    float arg; // f30
    float dsp; // f0
    float ar1h; // f7
    float ar2h; // f8
    int idp2; // r0
    int ipp2; // r0

    // References
    // -> static float tpi;
}

// Range: 0x8054C794 -> 0x8054C9A0
static void drftf1(int n /* r22 */, float * c /* r23 */, float * ch /* r24 */, float * wa /* r25 */, int * ifac /* r26 */) {
    // Local variables
    int i; // r3
    int k1; // r31
    int l1; // r30
    int l2; // r5
    int na; // r29
    int nf; // r28
    int ip; // r4
    int iw; // r27
    int ido; // r3
    int idl1; // r6
    int ix2; // r8
    int ix3; // r9
}

// Range: 0x8054C9A0 -> 0x8054C9CC
void drft_forward(struct {
    // total size: 0xC
    int n; // offset 0x0, size 0x4
    float * trigcache; // offset 0x4, size 0x4
    int * splitcache; // offset 0x8, size 0x4
} * l /* r7 */) {}

// Range: 0x8054C9CC -> 0x8054CA38
void drft_init(struct {
    // total size: 0xC
    int n; // offset 0x0, size 0x4
    float * trigcache; // offset 0x4, size 0x4
    int * splitcache; // offset 0x8, size 0x4
} * l /* r30 */, int n /* r31 */) {}

// Range: 0x8054CA38 -> 0x8054CA98
void drft_clear(struct {
    // total size: 0xC
    int n; // offset 0x0, size 0x4
    float * trigcache; // offset 0x4, size 0x4
    int * splitcache; // offset 0x8, size 0x4
} * l /* r31 */) {}


