/*
    Compile unit: C:\rockband2\band2\src\net_band\RBBandDDL.cpp
    Producer: MW EABI PPC C-Compiler
    Language: C++
    Code range: 0x80219A00 -> 0x80219B88
*/
class _DDL_RBBand : public RootObject {
    // total size: 0x28
public:
    void * __vptr$; // offset 0x0, size 0x4
    unsigned int mLeaderID; // offset 0x4, size 0x4
    class String mName; // offset 0x8, size 0x4
    class String mMotto; // offset 0xC, size 0x4
    class String mHometown; // offset 0x10, size 0x4
    class String mLogoName; // offset 0x14, size 0x4
    unsigned int mStars; // offset 0x18, size 0x4
    unsigned int mStarRating; // offset 0x1C, size 0x4
    unsigned int mDiffRating; // offset 0x20, size 0x4
    unsigned int mTotalScore; // offset 0x24, size 0x4
};
// Range: 0x80219A00 -> 0x80219AC4
void _DDL_RBBand::Add(class Message * pMessageToSend /* r30 */, const class _DDL_RBBand & oValue /* r31 */) {}

// Range: 0x80219AC4 -> 0x80219B88
void _DDL_RBBand::Extract(class Message * pReceivedMessage /* r30 */, class _DDL_RBBand * pValue /* r31 */) {}


