/*
    Compile unit: C:\rockband2\system\src\rndobj\Fur.cpp
    Producer: MW EABI PPC C-Compiler
    Language: C++
    Code range: 0x8049ECC0 -> 0x8049F8CC
*/
class DataArray * types; // size: 0x4, address: 0x80A52F10
class Symbol name; // size: 0x4, address: 0x80A52F18
class RndFur : public Object {
    // total size: 0x80
public:
    int mNumPasses; // offset 0x28, size 0x4
    float mThickness; // offset 0x2C, size 0x4
    float mCurvature; // offset 0x30, size 0x4
    float mShellOut; // offset 0x34, size 0x4
    float mAlphaFalloff; // offset 0x38, size 0x4
    float mStretch; // offset 0x3C, size 0x4
    float mSlide; // offset 0x40, size 0x4
    float mGravity; // offset 0x44, size 0x4
    float mFluidity; // offset 0x48, size 0x4
    class Color mBaseTint; // offset 0x50, size 0x10
    class Color mEndTint; // offset 0x60, size 0x10
    class ObjPtr mFurDetail; // offset 0x70, size 0xC
    float mFurTiling; // offset 0x7C, size 0x4
};
// Range: 0x8049ECC0 -> 0x8049ED84
void * RndFur::RndFur(class RndFur * const this /* r31 */) {
    // References
    // -> struct [anonymous] __vt__26ObjPtr<6RndTex,9ObjectDir>;
    // -> struct [anonymous] __vt__6RndFur;
}

static class Symbol _s; // size: 0x4, address: 0x80A52F20
static class Symbol _s; // size: 0x4, address: 0x80A52F28
static class Symbol _s; // size: 0x4, address: 0x80A52F30
static class Symbol _s; // size: 0x4, address: 0x80A52F38
static class Symbol _s; // size: 0x4, address: 0x80A52F40
static class Symbol _s; // size: 0x4, address: 0x80A52F48
static class Symbol _s; // size: 0x4, address: 0x80A52F50
static class Symbol _s; // size: 0x4, address: 0x80A52F58
static class Symbol _s; // size: 0x4, address: 0x80A52F60
static class Symbol _s; // size: 0x4, address: 0x80A52F68
static class Symbol _s; // size: 0x4, address: 0x80A52F70
static class Symbol _s; // size: 0x4, address: 0x80A52F78
static class Symbol _s; // size: 0x4, address: 0x80A52F80
// Range: 0x8049EE08 -> 0x8049F8CC
unsigned char RndFur::SyncProperty(class RndFur * const this /* r26 */, class DataNode & _val /* r27 */, class DataArray * _prop /* r28 */, int _i /* r29 */, enum PropOp _op /* r30 */) {
    // References
    // -> static class Symbol _s;
    // -> static class Symbol _s;
    // -> static class Symbol _s;
    // -> static class Symbol _s;
    // -> static class Symbol _s;
    // -> static class Symbol _s;
    // -> static class Symbol _s;
    // -> static class Symbol _s;
    // -> static class Symbol _s;
    // -> static class Symbol _s;
    // -> static class Symbol _s;
    // -> static class Symbol _s;
    // -> class Debug TheDebug;
    // -> const char * kAssertStr;
    // -> static class Symbol _s;
}

struct {
    // total size: 0x5C
} __vt__6RndFur; // size: 0x5C, address: 0x808F79CC
struct {
    // total size: 0x8
} __RTTI__6RndFur; // size: 0x8, address: 0x808F7A48

