/*
    Compile unit: C:\rockband2\system\src\rndobj\Shader.cpp
    Producer: MW EABI PPC C-Compiler
    Language: C++
    Code range: 0x804FDB8C -> 0x804FDB8C
*/
class NgStats {
    // total size: 0x2C
public:
    int faces; // offset 0x0, size 0x4
    int particles; // offset 0x4, size 0x4
    int partsys; // offset 0x8, size 0x4
    int reg_meshes; // offset 0xC, size 0x4
    int mut_meshes; // offset 0x10, size 0x4
    int bones; // offset 0x14, size 0x4
    int mats; // offset 0x18, size 0x4
    int cams; // offset 0x1C, size 0x4
    int lights; // offset 0x20, size 0x4
    int multimesh; // offset 0x24, size 0x4
    int flares; // offset 0x28, size 0x4
};

