/*
    Compile unit: C:\rockband2\band2\src\meta\MatchmakingSlot.cpp
    Producer: MW EABI PPC C-Compiler
    Language: C++
    Code range: 0x8010BADC -> 0x801148E0
*/
static class Symbol joypad; // size: 0x4, address: 0x80A4B53C
static class Symbol instrument_mapping; // size: 0x4, address: 0x80A4B544
// Range: 0x8010BADC -> 0x8010BC0C
enum ControllerType GetConnectedControllerType(int padNum /* r30 */) {
    // Local variables
    enum ControllerType ctOverride; // r0
    class Symbol controller; // r1+0x18
    class DataArray * cfg; // r0
    class DataArray * data; // r30
    enum ControllerType ct; // r30

    // References
    // -> class Debug TheDebug;
    // -> const char * kAssertStr;
    // -> static class Symbol instrument_mapping;
    // -> static class Symbol joypad;
    // -> class BandUserMgr * TheBandUserMgr;
}

// Range: 0x8010BC0C -> 0x8010BD40
void GetPadsWithoutUsers(class vector * pFakeUsers /* r29 */, enum ControllerType ct /* r30 */) {
    // Local variables
    int i; // r31
    class JoypadData * pData; // r0

    // References
    // -> class PlatformMgr ThePlatformMgr;
    // -> int kNonUser;
}

// Range: 0x8010BD40 -> 0x8010BD84
void * FakeBandUser::FakeBandUser(struct FakeBandUser * const this /* r31 */) {}

// Range: 0x8010BD84 -> 0x8010BDC4
void * FakeBandUser::FakeBandUser(struct FakeBandUser * const this /* r31 */) {}

// Range: 0x8010BDC4 -> 0x8010BE0C
void * FakeBandUser::FakeBandUser(struct FakeBandUser * const this /* r31 */, int pad /* r6 */) {}

// Range: 0x8010BE0C -> 0x8010BE28
int FakeBandUser::GetPadNum() {}

// Range: 0x8010BE28 -> 0x8010BE70
char * FakeBandUser::GetUserName() {
    // Local variables
    int padNum; // r0

    // References
    // -> class PlatformMgr ThePlatformMgr;
}

// Range: 0x8010BE70 -> 0x8010BE98
enum ControllerType FakeBandUser::ConnectedControllerType() {}

// Range: 0x8010BE98 -> 0x8010BEBC
unsigned char FakeBandUser::IsParticipating() {}

// Range: 0x8010BEBC -> 0x8010BEE0
unsigned char FakeBandUser::IsLocalPlayer() {}

// Range: 0x8010BEE0 -> 0x8010BF04
unsigned char FakeBandUser::IsJoypadConnected() {}

struct UserName {
    // total size: 0x10
    class String mUserName; // offset 0x0, size 0xC
    int mPadNum; // offset 0xC, size 0x4
};
class StlNodeAlloc {
    // total size: 0x1
};
class _STLP_alloc_proxy : public StlNodeAlloc {
    // total size: 0x4
public:
    struct UserName * _M_data; // offset 0x0, size 0x4
};
class _Vector_base {
    // total size: 0xC
protected:
    struct UserName * _M_start; // offset 0x0, size 0x4
    struct UserName * _M_finish; // offset 0x4, size 0x4
    class _STLP_alloc_proxy _M_end_of_storage; // offset 0x8, size 0x4
};
class vector : protected _Vector_base {
    // total size: 0xC
};
class UserNameProvider : public ListProvider, public Object {
    // total size: 0x3C
    class vector mUserNames; // offset 0x2C, size 0xC
    class MatchmakingSlot * mMMSlot; // offset 0x38, size 0x4
};
// Range: 0x8010BF04 -> 0x8010C020
void * MatchmakingSlot::MatchmakingSlot(class MatchmakingSlot * const this /* r28 */, class MatchmakingScreen * pMMScreen /* r29 */, int slotNum /* r30 */, class PanelDir * pDir /* r31 */) {
    // References
    // -> const char * gNullStr;
    // -> struct [anonymous] __vt__15MatchmakingSlot;
}

// Range: 0x8010C020 -> 0x8010C170
void * MatchmakingSlot::~MatchmakingSlot(class MatchmakingSlot * const this /* r30 */) {
    // References
    // -> struct [anonymous] __vt__15MatchmakingSlot;
}

// Range: 0x8010C170 -> 0x8010C178
class ObjectDir * MatchmakingSlot::DataDir() {}

static class Symbol is_h2h_arrangement; // size: 0x4, address: 0x80A4B54C
static class Symbol slot; // size: 0x4, address: 0x80A4B554
static class Message msgEnter; // size: 0x8, address: 0x80978DB0
// Range: 0x8010C178 -> 0x8010CE90
void MatchmakingSlot::Enter(class MatchmakingSlot * const this /* r30 */) {
