/*
    Compile unit: C:\rockband2\band2\src\meta\MatchmakingScreen.cpp
    Producer: MW EABI PPC C-Compiler
    Language: C++
    Code range: 0x80104C04 -> 0x8010AF7C
*/
class DataArray * types; // size: 0x4, address: 0x80A4B3B0
class Symbol name; // size: 0x4, address: 0x80A4B3B8
class Symbol t; // size: 0x4, address: 0x80A4B3C0
class Symbol t; // size: 0x4, address: 0x80A4B3C8
class Symbol t; // size: 0x4, address: 0x80A4B3D0
class MatchmakingScreen : public AutoloadScreen {
    // total size: 0x70
    class DataArray * mOptions; // offset 0x4C, size 0x4
    class vector mSlots; // offset 0x50, size 0xC
    class vector mAutoJoinPadNums; // offset 0x5C, size 0xC
    int mAutoJoinSlotNum; // offset 0x68, size 0x4
    unsigned char mTriggerAutoJoinFailMsg; // offset 0x6C, size 0x1
    unsigned char mPendingAbandonSession; // offset 0x6D, size 0x1
};
// Range: 0x80104C04 -> 0x80104C6C
void * MatchmakingScreen::MatchmakingScreen(class MatchmakingScreen * const this /* r31 */) {
    // References
    // -> struct [anonymous] __vt__17MatchmakingScreen;
}

class StlNodeAlloc {
    // total size: 0x1
};
class _STLP_alloc_proxy : public StlNodeAlloc {
    // total size: 0x4
public:
    class MatchmakingSlot * * _M_data; // offset 0x0, size 0x4
};
class _Vector_base {
    // total size: 0xC
protected:
    class MatchmakingSlot * * _M_start; // offset 0x0, size 0x4
    class MatchmakingSlot * * _M_finish; // offset 0x4, size 0x4
    class _STLP_alloc_proxy _M_end_of_storage; // offset 0x8, size 0x4
};
class vector : protected _Vector_base {
    // total size: 0xC
};
// Range: 0x80104C6C -> 0x80104D4C
void * MatchmakingScreen::~MatchmakingScreen(class MatchmakingScreen * const this /* r30 */) {
    // References
    // -> struct [anonymous] __vt__17MatchmakingScreen;
}

static class Message ready; // size: 0x8, address: 0x80978CA8
static class Symbol is_tour; // size: 0x4, address: 0x80A4B3D8
struct FakeBandUser {
    // total size: 0x14
    class BandUser * mUser; // offset 0x0, size 0x4
    int mPadNum; // offset 0x4, size 0x4
    class String mStrName; // offset 0x8, size 0xC
};
enum JoinState {
    kMetaJoinNeedsOnline = 0,
    kMetaJoinGuestNotFirst = 1,
    kMetaJoinOK = 2,
};
struct UserJoinEntry {
    // total size: 0x18
    struct FakeBandUser mUser; // offset 0x0, size 0x14
    enum JoinState mState; // offset 0x14, size 0x4
};
class StlNodeAlloc {
    // total size: 0x1
};
class _STLP_alloc_proxy : public StlNodeAlloc {
    // total size: 0x4
public:
    struct UserJoinEntry * _M_data; // offset 0x0, size 0x4
};
class _Vector_base {
    // total size: 0xC
protected:
    struct UserJoinEntry * _M_start; // offset 0x0, size 0x4
    struct UserJoinEntry * _M_finish; // offset 0x4, size 0x4
    class _STLP_alloc_proxy _M_end_of_storage; // offset 0x8, size 0x4
};
class vector : protected _Vector_base {
    // total size: 0xC
};
class StlNodeAlloc {
    // total size: 0x1
};
class _STLP_alloc_proxy : public StlNodeAlloc {
    // total size: 0x4
public:
    struct FakeBandUser * _M_data; // offset 0x0, size 0x4
};
class _Vector_base {
    // total size: 0xC
protected:
    struct FakeBandUser * _M_start; // offset 0x0, size 0x4
    struct FakeBandUser * _M_finish; // offset 0x4, size 0x4
    class _STLP_alloc_proxy _M_end_of_storage; // offset 0x8, size 0x4
};
class vector : protected _Vector_base {
    // total size: 0xC
};
class MatchmakingSlot : public Object {
    // total size: 0x100
    class Symbol mSymOption; // offset 0x28, size 0x4
    class MatchmakingScreen * mMMScreen; // offset 0x2C, size 0x4
    int mSlotNum; // offset 0x30, size 0x4
    class PanelDir * mPanelDir; // offset 0x34, size 0x4
    class CharProvider mCharProvider; // offset 0x38, size 0x54
    unsigned char mSendFocusMsg; // offset 0x8C, size 0x1
    class UserNameProvider * mUserNameProvider; // offset 0x90, size 0x4
    class vector mUserJoinList; // offset 0x94, size 0xC
    unsigned char mAllowedActions[16]; // offset 0xA0, size 0x10
    class CharData * mPrevChar; // offset 0xB0, size 0x4
    unsigned char mHasChars; // offset 0xB4, size 0x1
    int mLastButtonPadNum; // offset 0xB8, size 0x4
    int mLastButtonUserNum; // offset 0xBC, size 0x4
    enum JoypadButton mLastButtonRawButton; // offset 0xC0, size 0x4
    enum JoypadAction mLastButtonAction; // offset 0xC4, size 0x4
    class RndGroup * mSingleInstGrp; // offset 0xC8, size 0x4
    class RndGroup * mMultiInstGrp; // offset 0xCC, size 0x4
    class RndGroup * mTopGrp; // offset 0xD0, size 0x4
    class RndGroup * mBottomGrp; // offset 0xD4, size 0x4
    class RndGroup * mRemoteOnlyGrp; // offset 0xD8, size 0x4
    class RndGroup * mNoInstGrp; // offset 0xDC, size 0x4
    class RndGroup * mUserNameGrp; // offset 0xE0, size 0x4
    class RndGroup * mSignInGrp; // offset 0xE4, size 0x4
    class RndGroup * mGuestNotFirstGrp; // offset 0xE8, size 0x4
    class RndGroup * mJoinGrp; // offset 0xEC, size 0x4
    class RndGroup * mUserNameJoinedGrp; // offset 0xF0, size 0x4
    class RndGroup * mBottomChoosePartGrp; // offset 0xF4, size 0x4
    class RndGroup * mBottomChooseCharGrp; // offset 0xF8, size 0x4
    class RndGroup * mFindingGrp; // offset 0xFC, size 0x4
};
// Range: 0x80104D4C -> 0x80105088
unsigned char MatchmakingScreen::IsEveryoneReady(class MatchmakingScreen * const this /* r30 */) {
    // Local variables
    class MatchmakingSlot * * it; // r28
    class MatchmakingSlot * pSlot; // r29
    class DataNode n; // r1+0x28

    // References
    // -> const char * gNullStr;
    // -> class Debug TheDebug;
    // -> const char * kAssertStr;
    // -> class Tour * TheTour;
    // -> class GameMode * TheGameMode;
    // -> static class Symbol is_tour;
    // -> static class Message ready;
    // -> struct [anonymous] __vt__7Message;
}

static class Message msgIsReady; // size: 0x8, address: 0x80978CC0
static class Symbol ready; // size: 0x4, address: 0x80A4B3E0
// Range: 0x80105088 -> 0x8010527C
unsigned char MatchmakingScreen::IsEveryLocalSlotReady(class MatchmakingScreen * const this /* r30 */) {
    // Local variables
    class MatchmakingSlot * * it; // r27
